{
    "title": "White Chicken Chili That Actually Sets Properly",
    "promptIMG": "Professional food photography prompt: \"Creamy chicken chili, served in a rustic bowl, natural food photography, balanced sharp focus throughout entire image, zero blur, infinite depth of field, realistic food textures, modern kitchen background in sharp focus, natural window lighting, kitchen countertop visible, even focus distribution, documentary food photography style, professional food styling, appetizing presentation --no blur, depth of field, bokeh, over-sharpening, artificial enhancement --quality 2 --ar 4:3 --stylize 300\"",
    "isOnline": true,
    "description": "A properly balanced white chicken chili that's ready in about thirty-five minutes with enough flavor to feel intentional rather than rushed. The key is cooking each component properly rather than just combining everything at once.",
    "hashtags": "#chickenchili #easyrecipes #comfortfood #weeknightdinner #onepotrecipe",
    "difficulty": "Easy",
    "prep_time": 10,
    "cook_time": 25,
    "servings": 4,
    "ingredients": [
        "1 pound boneless, skinless chicken breast (about 2 large breasts)",
        "1 can (15 ounces) white beans, drained and rinsed",
        "1½ cups low-sodium chicken broth",
        "¾ cup heavy cream or half-and-half",
        "1 cup corn, fresh or frozen",
        "1 medium onion, diced",
        "3 cloves garlic, minced",
        "1 teaspoon chili powder",
        "½ teaspoon ground cumin",
        "½ teaspoon dried oregano",
        "Salt and freshly ground black pepper to taste",
        "1 tablespoon oil or butter for sautéing",
        "Fresh cilantro for garnish (optional but recommended)"
    ],
    "instructions": [
        "Season the chicken breasts with salt and pepper on both sides. Heat a tablespoon of oil or butter in a large pot over medium-high heat. Once the pan is hot, add the chicken and cook for about 5-6 minutes per side until the internal temperature reaches 165°F. The chicken won't be fully cooked through yet, and that's intentional—we're just developing flavor and partial cooking before it simmers in the liquid. Remove the chicken to a cutting board.",
        "In the same pot, reduce heat to medium and add the diced onion to the residual oil and chicken drippings. These browned bits on the bottom of the pot, called fond, contain concentrated flavor and will dissolve into the sauce. Cook the onion until it becomes translucent, which takes about 5 minutes. Stir occasionally to avoid sticking.",
        "Add the minced garlic to the pot and cook for just one minute until fragrant. Longer than this and the garlic can become bitter, which will taste unpleasant in the final dish. Immediately add the chili powder, cumin, and oregano while stirring. Toasting the spices in the fat for about 30 seconds blooms their flavor and prevents them from tasting raw.",
        "Once the spices have become fragrant, pour in the chicken broth, stirring well to dissolve any browned bits from the bottom of the pot. This process of deglazing both cleans the pot and intensifies the sauce flavor. Bring this to a gentle simmer.",
        "Cut the cooked chicken into bite-sized pieces and add it back to the pot along with the white beans and corn. Simmer for about 5-7 minutes, allowing the flavors to meld and the chicken to finish cooking through. The beans don't need cooking since they come pre-cooked in the can, but simmering them with the other ingredients helps them absorb the spice flavors.",
        "Lower the heat to the lowest setting on your stove. Slowly pour in the heavy cream or half-and-half while stirring constantly. This steady incorporation is important because cream is sensitive to temperature shock and vigorous heating, which can cause it to separate or curdle. Keep stirring for about 2 minutes as you add it and continue stirring for another minute afterward to ensure even distribution.",
        "Taste the chili and adjust the seasoning. You may need more salt, pepper, or chili powder depending on your preference and the saltiness of your broth. Let the chili simmer gently for just 2-3 minutes more, then serve while hot. Avoid boiling once the cream is added, as high heat can break the cream and make the sauce grainy."
    ],
    "image_keywords": [
        "creamy chicken chili",
        "white bean chili",
        "easy dinner",
        "comfort food",
        "one-pot recipe"
    ],
    "structured_content": [
        {
            "section_type": "introduction",
            "headline": "White Chicken Chili That Actually Sets Properly",
            "content": "<p>I make creamy chicken chili regularly because it bridges the gap between quick weeknight dinner and something that tastes like I've spent hours on it. The process takes about thirty-five minutes from start to finish, which is manageable on a Monday after work. What actually matters is that the result is a properly balanced dish—the cream isn't separated, the chicken isn't rubbery, the spices are integrated rather than scattered—rather than something that tastes rushed.</p>\n\n<p>The first time I made this recipe, I cut every corner I could find. I didn't brown the chicken, I just tossed everything into the pot at once, and I added the cream to an active boil. The resulting dish was technically done in twenty minutes but tasted underseasoned, separated, and disappointed me. Over the next several batches, I adjusted each step, and now I understand why each part matters. This isn't a complicated recipe—there are only seven steps—but those steps exist for specific reasons that affect the final result.</p>\n\n<p>Creamy chicken chili occupies a specific place in the comfort food landscape. It's technically a soup or stew, though calling it chili gives it a casual authority. What distinguishes it from other cream-based chicken dishes is the combination of spices that create that chili flavor identity. This recipe works because it balances multiple competing elements: the creaminess that could otherwise make it feel heavy, the spices that prevent it from being bland, the beans that add substance without overwhelming the dish, and the corn that provides gentle sweetness without tasting sweet. Unlike red chilis that develop flavor through long simmering and the breaking down of tomatoes, this white version needs each component properly prepared because there's no long cook time to develop complexity.</p>"
        },
        {
            "section_type": "ingredients",
            "headline": "Ingredient Selection and Substitutions",
            "content": "<p><strong>About the chicken:</strong> Chicken breast is standard here because it's mild, cooks quickly, and shreds easily if you prefer a shredded chili over chunks. However, chicken thighs actually make better chili because they're more forgiving—thighs stay moist even if slightly overcooked, while breasts turn grainy and dry very easily. If using thighs, increase the cooking time slightly since they're thicker. Don't use pre-cooked rotisserie chicken for the main protein because you lose the opportunity to develop flavor through browning, though you could use it if you're in an extreme time crunch.</p>\n\n<p><strong>White beans versus alternatives:</strong> Cannellini beans are the traditional choice, but great northern beans work identically. I've tried substituting kidney beans or pinto beans, and they change the dish's character—darker beans make the cream look dingy and their flavors compete with the subtle spicing. Stick with white beans.</p>\n\n<p><strong>Cream considerations:</strong> Heavy cream (36-40% fat) creates the richest sauce, while half-and-half (10-12% fat) produces something lighter but still creamy. Both work. I use half-and-half when I'm making this for a lighter meal. Avoid using milk, which won't provide richness and may curdle more easily. If you want to avoid dairy, coconut cream substitutes one-to-one for heavy cream. Full-fat coconut milk works also, though it's slightly thinner. The coconut flavor is noticeable but harmonizes with the spices. Cashew cream made by blending soaked raw cashews with water also works, though it's more involved.</p>\n\n<p><strong>Corn options:</strong> Frozen corn is genuinely superior to fresh in this application because of how it's preserved at peak ripeness. When corn is frozen commercially, it's picked fully ripe and frozen within hours. If you're buying fresh, look for corn used within a day of purchase. Canned corn tends to be mushy and less flavorful. Frozen corn from your freezer stays consistently good.</p>\n\n<p><strong>Broth choice:</strong> Low-sodium broth lets you control salt levels. Standard broth is often too salty, making it hard to adjust seasoning properly. If you only have regular broth, reduce the amount you use and add water instead. I always reach for low-sodium because I'd rather season a mild base than try to desalt something overly salty.</p>"
        },
        {
            "upload": {
                "context": "Searing chicken breast in a pot over medium-high heat to develop browning and flavor",
                "url": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_1.webp"
            }
        },
        {
            "section_type": "instructions",
            "headline": "Making the Chili: Step-by-Step with Technical Explanations",
            "content": "<h3>Step 1: Sear the Chicken for Flavor</h3>\n\n<p>Browning the chicken before simmering it isn't about cooking it through—it's about flavor development. When chicken reaches about 140°F on the surface, the proteins and amino acids undergo the Maillard reaction, creating hundreds of new flavor compounds. These dissolve into the sauce as the chicken finishes cooking. If you skip this step, your chili tastes perfectly fine but noticeably less savory. The sear takes five minutes and is worth it. Season both sides generously with salt and pepper, then let the oil heat until it shimmers slightly before adding the chicken. This ensures a proper sear rather than the chicken steaming in its own moisture.</p>\n\n<h3>Step 2: Build the Aromatics Base</h3>\n\n<p>After removing the chicken, you'll notice brown bits stuck to the bottom of the pot. These are concentrated protein and caramelized flavors, not burned food. They dissolve into the sauce when you add liquid. This process is called deglazing, and it's essential to flavorful cooking. The onion cooks in the residual oil and these browned bits, absorbing all those flavors. Cook the onion until it's translucent with just a hint of golden color at the edges. This takes about five minutes over medium heat.</p>\n\n<h3>Step 3: Bloom the Spices</h3>\n\n<p>When you add chili powder, cumin, and oregano directly to the pot with fat and aromatic vegetables, the heat activates the essential oils in the spices, intensifying their flavor. This takes about thirty seconds. If you add spices directly to liquid without this fat-based blooming, they can taste dusty and underdeveloped. Some recipes skip this step and it shows in the final flavor. You'll notice the aroma immediately changes—it becomes more complex and appetizing.</p>\n\n<h3>Step 4: Build the Liquid Base</h3>\n\n<p>The broth must come to a simmer so it can thin out slightly and distribute flavors evenly. The beans and corn don't need cooking—they're already fully cooked from their canned state—but simmering them in the spiced broth for a few minutes allows them to absorb those flavors rather than just sitting in liquid. The simmering step takes five to seven minutes and noticeably improves the final result.</p>\n\n<h3>Step 5: Add the Cream Carefully</h3>\n\n<p>This is the most critical step for success. Cold or room-temperature cream hitting boiling liquid experiences thermal shock. The rapid temperature change causes the cream proteins to coagulate and separate, leaving you with an oily, broken sauce. To prevent this, add cream slowly while stirring on low heat. Stir constantly as you pour and continue stirring for a minute after. The motion ensures even temperature distribution and prevents the cream from suddenly hitting very hot spots in the pan. If your sauce looks slightly separated or grainy even with careful technique, it's fine—it will even out as it cools and sits.</p>\n\n<h3>Step 6: Taste and Season</h3>\n\n<p>Once the cream is incorporated, taste the chili and adjust. Sometimes the broth is saltier than expected. Sometimes you want more chili powder. You're not committing to these additions permanently—taste, adjust, and taste again. It's perfectly normal to add extra seasoning after the fact.</p>\n\n<h3>Step 7: Final Simmer and Serve</h3>\n\n<p>Once the cream is added, the chili should only barely simmer. You're no longer cooking ingredients; you're keeping everything warm and allowing flavors to meld. High heat after cream addition is the primary cause of separation. The final two to three minutes allow the flavors to integrate and the spices to distribute evenly throughout the cream sauce.</p>"
        },
        {
            "upload": {
                "context": "Pouring heavy cream into the simmering chicken and vegetable mixture while stirring",
                "url": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_3.webp"
            }
        },
        {
            "section_type": "pro_tips",
            "headline": "Pro Tips from Multiple Batches",
            "content": "<p><strong>Invest in a meat thermometer:</strong> I learned this the hard way. Chicken breast cooked much beyond 165°F becomes unpleasantly dense and dry. Many home cooks assume all meat must cook to well-done for safety, but chicken is safely cooked at 165°F. A reliable instant-read thermometer removes guesswork entirely. If your first attempt turned out dry, your thermometer might be inaccurate, or you maintained higher heat than intended. This is a five-dollar tool that eliminates the most common complaint about this recipe.</p>\n\n<p><strong>Don't skip browning the chicken:</strong> I tested this by making a batch without browning—just poaching the chicken in broth from the start. The resulting chili was technically done and edible, but it had a pale, underseasoned taste. The browning step takes five minutes and is the difference between good chili and forgettable chili. The Maillard reaction that creates that brown crust develops flavor compounds that dissolve into the sauce, and there's no substitute for that.</p>\n\n<p><strong>White beans are non-negotiable:</strong> White beans specifically work better here than pinto or kidney beans because they're milder and creamier. They don't compete with the cream sauce. If you substituted darker beans, they'd dominate the flavor and look muddy when mixed with the cream. The first time I made this with pinto beans (because that's what I had), the result was noticeably less balanced and less visually appealing.</p>\n\n<p><strong>Low heat after adding cream:</strong> This is the single most important rule for preventing a broken sauce. I made the mistake of maintaining a rolling boil after adding cream once, and the sauce separated into greasy puddles on top and watery liquid below. The cream proteins coagulate and separate when exposed to sustained high heat. A gentle simmer that barely shows a few bubbles rising is the right temperature. If you're worried you're not heating it enough, you're probably heating it perfectly.</p>\n\n<p><strong>Frozen corn is actually superior:</strong> This runs counter to the conventional wisdom that fresh is always better. Frozen corn is picked at peak ripeness, immediately frozen, and stays sweeter longer. Fresh corn from the grocery store is often several days old and has lost sugar content. Frozen corn contributes sweetness that balances the spices without requiring additional sugar. I've tested both extensively and consistently prefer frozen in this application.</p>\n\n<p><strong>Leftovers improve overnight:</strong> I often make this as a four-serving batch knowing the leftovers will be better than the first serving. The starches from the beans release slowly, thickening the sauce further as it sits. The spices have more time to develop. The flavors blend and deepen. This isn't a flaw—it's actually a strength of the recipe. Some comfort food dishes are best the day they're made, but this white chili genuinely improves overnight.</p>"
        },
        {
            "section_type": "variations",
            "headline": "Variations and Adaptations",
            "content": "<p><strong>Adding heat:</strong> If you want more spice, increase the chili powder by half a teaspoon and add a diced jalapeño or a small pinch of cayenne pepper. Start small because heat compounds build as flavors meld. I usually add jalapeño rather than increasing the powder, as it provides heat without changing the flavor profile.</p>\n\n<p><strong>Protein variations:</strong> Ground chicken works in this recipe—brown it thoroughly before adding the onion and it will break into small pieces throughout the chili. Ground turkey produces a similar result. For non-poultry options, ground turkey or lean ground beef both work. If using ground meat, cook it until browned and broken apart, then remove it and add it back at the end with the beans, similar to how you do the seared chicken.</p>\n\n<p><strong>Vegetable additions:</strong> Diced bell peppers can replace some of the onion for a different flavor profile. Add them when you add the onion, as they'll cook in the same amount of time. A handful of fresh spinach stirred in right before serving adds nutrition without changing the flavor significantly. Diced zucchini works similarly if you want to stretch the recipe further.</p>\n\n<p><strong>Dairy-free adaptation:</strong> Coconut cream substitutes one-to-one for heavy cream. Full-fat coconut milk works also, though it's slightly thinner. The coconut flavor is noticeable but harmonizes with the spices nicely. Cashew cream made by blending soaked raw cashews with water also works, though it's more involved to prepare.</p>\n\n<p><strong>Lighter version:</strong> Using half-and-half instead of heavy cream reduces fat content significantly while maintaining creaminess. You could also use Greek yogurt stirred in at the very end off heat, which adds tanginess and creaminess. This creates a noticeably different texture but is delicious and less rich.</p>\n\n<p><strong>Slow cooker method:</strong> You can make this in a slow cooker if you brown the chicken and vegetables in a separate pot first, then transfer everything to the slow cooker. Cook on low for 4-5 hours or high for 2-3 hours. Add the cream in the last 30 minutes on low heat. This extends cooking time significantly, so it's not a time saver, but it frees up your stovetop.</p>"
        },
        {
            "upload": {
                "context": "Finished creamy white chicken chili in a bowl garnished with fresh cilantro",
                "url": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_2.webp"
            }
        },
        {
            "section_type": "common_mistakes",
            "headline": "Common Issues and How to Prevent Them",
            "content": "<p><strong>Separated, broken cream sauce:</strong> This happens when cream is added to boiling liquid or when it boils after being added. The heat causes the fat and water in cream to separate, creating an oily, unappetizing appearance. Prevention is straightforward: reduce heat before adding cream, add slowly while stirring, and avoid boiling after addition. If it happens anyway, the chili is still fine to eat, though the texture is grainier. Next time, you'll know what to adjust. This is the most common complaint I hear about cream-based soups, and it's entirely preventable with attention to temperature.</p>\n\n<p><strong>Rubbery, dry chicken:</strong> Chicken breast cooked much beyond 165°F becomes unpleasantly dense and dry. This is the most common way to ruin this dish. A meat thermometer is genuinely essential here, not optional. If your first attempt turned out dry, your thermometer might be inaccurate—test it by placing it in boiling water (it should read 212°F)—or you maintained higher heat than you thought. Chicken breast is forgiving up to 165°F but becomes progressively worse with every degree above that.</p>\n\n<p><strong>Bland, one-dimensional flavor:</strong> This usually comes from underseasoning or not blooming the spices. Some home cooks reduce spice quantities thinking they'll go easier on heat, but chili powder provides flavor in addition to spice. Use the full teaspoon. Taste the finished chili before serving and adjust—it's not cheating to add more seasoning after the fact. Sometimes the broth is saltier than expected or the spices seem muted. This is normal. Taste and adjust accordingly.</p>"
        },
        {
            "section_type": "storage",
            "headline": "Storage, Reheating, and Flavor Development",
            "content": "<p><strong>Serving fresh:</strong> The chili is best served within a few minutes of finishing. Serve while the cream is still fully integrated and the temperature is hot throughout. The flavors are fresh and the texture is exactly as intended.</p>\n\n<p><strong>Refrigerator storage:</strong> Cover and store in the refrigerator for up to 4 days. As it sits, the starches from the beans release slowly, thickening the sauce further. This is why leftovers always seem creamier and more flavorful than the first serving. The flavors meld as they sit, and the dish becomes noticeably better on day two. I intentionally make extra knowing the next day's meal will be superior.</p>\n\n<p><strong>Freezing:</strong> White cream-based chilis freeze acceptably but not perfectly. The cream can separate slightly during freezing and thawing. If you do freeze it, let it cool completely, place in a freezer-safe container with headspace (cream expands slightly), and freeze for up to 2 months. To thaw, move to the refrigerator overnight and reheat gently on the stovetop at low heat, stirring occasionally. Add a splash of broth if it seems too thick after thawing.</p>\n\n<p><strong>Reheating from refrigerator:</strong> Place the desired amount in a pot over medium-low heat. Stir occasionally. Don't allow it to boil vigorously or the cream can separate again. It usually takes about 5-8 minutes to reach serving temperature. If it thickens as it sits in the refrigerator, add a splash of broth or water to restore the sauce consistency. The starches from the beans thicken the sauce further overnight, which is desirable but sometimes requires thinning.</p>\n\n<p><strong>Flavor progression:</strong> I make this recipe knowing that the leftover meals will be better than the first serving. The spices have more time to develop. The beans thicken the sauce further. The flavors integrate and deepen. This isn't a flaw—it's actually a strength of the recipe. Some comfort food dishes are best the day they're made, but this white chili genuinely improves overnight.</p>"
        },
        {
            "section_type": "faq",
            "headline": "Frequently Asked Questions",
            "content": "<p><strong>How long does this really take?</strong> The recipe is about thirty-five minutes start to finish if you're prepping ingredients as you go. If you prep everything before you start cooking (mise en place), it takes about twenty-five minutes of actual cooking time. It's genuinely faster than most dinners when you account for the fact that it's a complete meal in one pot with minimal cleanup.</p>\n\n<p><strong>Can I use store-bought rotisserie chicken?</strong> Yes, shred about one and a half cups of rotisserie chicken meat and add it directly after the spices are bloomed. You'll lose some browning-related flavor because rotisserie chicken doesn't brown further in the pot, but the convenience might be worth the trade-off if you're truly pressed for time.</p>\n\n<p><strong>What if I don't like cilantro?</strong> Cilantro is entirely optional. Some people genuinely dislike it due to genetic factors that make it taste soapy. If that's you, skip it entirely or use parsley as a garnish, which adds brightness without the distinctive flavor.</p>\n\n<p><strong>How do I know when the chicken is actually done?</strong> Use an instant-read meat thermometer and pull the chicken when it reaches 165°F in the thickest part. This is the FDA-recommended safe temperature for poultry. A meat thermometer is the most reliable method. Visual cues like color or firmness are unreliable for chicken breast.</p>\n\n<p><strong>What if the cream sauce looks broken or separated?</strong> It won't affect taste meaningfully. Separated cream sauce occurs when cream hits boiling liquid or when the finished chili boils after cream is added. It's purely cosmetic and happens to experienced cooks too. Stir it well before serving and it usually integrates. The flavor is identical even if the appearance is less smooth.</p>\n\n<p><strong>Can I make this ahead for entertaining?</strong> Yes. You can prepare the chili through adding the cream and then let it cool and refrigerate overnight. Reheat gently on the stovetop before serving. Or prepare it two hours before guests arrive and keep it warm on very low heat. Either works perfectly. Many people prefer the next-day flavor anyway.</p>"
        },
        {
            "section_type": "conclusion",
            "headline": "Why This Recipe Works as Weeknight Cooking",
            "content": "<p>This dish succeeds because it balances several competing goals simultaneously. It's fast enough to make on a weeknight without feeling like you're rushing. It tastes good enough to serve to guests or make you genuinely excited about leftovers. It's forgiving enough that small variations don't ruin it. The technique is straightforward once you understand why each step matters. I make it regularly because it sits in the comfortable zone where weeknight cooking lives—faster than elaborate cooking but more intentional than heating something frozen. It consistently produces good results once you understand that properly browning the chicken, blooming the spices, and carefully incorporating the cream are the three non-negotiable steps. Everything else is flexible based on what you have and what you prefer. Let me know in the comments how your version turns out.</p>"
        }
    ],
    "category_id": "cat_1761230383_494",
    "generation_metadata": {
        "voice": "Experienced Home Cook",
        "complexity": "Intermediate",
        "target_words": "1400+",
        "temperature": 0.7,
        "generated_at": "2026-01-14 10:22:00",
        "rewrite_notes": "Complete restructuring into 9-section authentic format with strengthened personal voice, specific technical explanations, and authentic food blog patterns"
    },
    "author_id": "author_001",
    "images": [
        {
            "fileName": "30-minute-creamy-white-chicken-chili_image_1.webp",
            "filePath": "recipes/30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_1.webp",
            "relativePath": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_1.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_1.webp",
            "order": 1,
            "alt_text": "Chicken breast searing in a pot over medium-high heat to develop deep brown color and concentrated flavor"
        },
        {
            "fileName": "30-minute-creamy-white-chicken-chili_image_2.webp",
            "filePath": "recipes/30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_2.webp",
            "relativePath": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_2.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_2.webp",
            "order": 2,
            "alt_text": "Finished creamy white chicken chili in a rustic bowl garnished with fresh cilantro and a spoon"
        },
        {
            "fileName": "30-minute-creamy-white-chicken-chili_image_3.webp",
            "filePath": "recipes/30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_3.webp",
            "relativePath": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_3.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_3.webp",
            "order": 3,
            "alt_text": "Pouring heavy cream slowly into simmering chicken and white bean mixture while stirring constantly"
        },
        {
            "fileName": "30-minute-creamy-white-chicken-chili_LummyRecipes_image_4.webp",
            "filePath": "recipes/30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_LummyRecipes_image_4.webp",
            "relativePath": "30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_LummyRecipes_image_4.webp",
            "originalUrl": "http://localhost/SitePinterset/LummyRecipes/recipes/30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_LummyRecipes_image_4.webp",
            "order": 4,
            "type": "template"
        }
    ],
    "slug": "30-minute-creamy-white-chicken-chili",
    "id": "text_recipe_1761927375_608",
    "image": "30-minute-creamy-white-chicken-chili_image_1.webp",
    "image_path": "recipes/30-minute-creamy-white-chicken-chili/images/30-minute-creamy-white-chicken-chili_image_1.webp",
    "image_dir": "30-minute-creamy-white-chicken-chili/images",
    "generated_from_text": false,
    "has_rich_structure": true,
    "createdAt": "2026-01-04T16:29:43+01:00",
    "updatedAt": "2026-01-14T10:22:00+01:00"
}